_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
flatten_10 (Flatten)         (None, 4112)              0
_________________________________________________________________
dense_37 (Dense)             (None, 128)               526464
_________________________________________________________________
activation_28 (Activation)   (None, 128)               0
_________________________________________________________________
dense_38 (Dense)             (None, 64)                8256
_________________________________________________________________
activation_29 (Activation)   (None, 64)                0
_________________________________________________________________
dense_39 (Dense)             (None, 16)                1040
_________________________________________________________________
activation_30 (Activation)   (None, 16)                0
=================================================================
done, took 5105.661 seconds
Testing for 10 episodes ...
Episode 1: reward: 207.261, steps: 600
Episode 2: reward: 266.846, steps: 600
Episode 3: reward: 212.422, steps: 600
Episode 4: reward: 282.990, steps: 600
Episode 5: reward: 226.606, steps: 600
Episode 6: reward: 235.079, steps: 600
Episode 7: reward: 302.416, steps: 600
Episode 8: reward: 253.026, steps: 600
Episode 9: reward: 238.521, steps: 600
Episode 10: reward: 176.379, steps: 600



_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
flatten_2 (Flatten)          (None, 1088)              0
_________________________________________________________________
dense_5 (Dense)              (None, 128)               139392
_________________________________________________________________
activation_4 (Activation)    (None, 128)               0
_________________________________________________________________
dense_6 (Dense)              (None, 256)               33024
_________________________________________________________________
activation_5 (Activation)    (None, 256)               0
_________________________________________________________________
dense_7 (Dense)              (None, 16)                4112
_________________________________________________________________
activation_6 (Activation)    (None, 16)                0
=================================================================
Episode 1: reward: 256.620, steps: 600
Episode 2: reward: 194.820, steps: 600
Episode 3: reward: 225.538, steps: 600
Episode 4: reward: 215.331, steps: 600
Episode 5: reward: 246.723, steps: 600
Episode 6: reward: 182.945, steps: 600
Episode 7: reward: 237.153, steps: 600
Episode 8: reward: 207.212, steps: 600
Episode 9: reward: 188.499, steps: 600
Episode 10: reward: 230.362, steps: 600

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
flatten_7 (Flatten)          (None, 320)               0
_________________________________________________________________
dense_25 (Dense)             (None, 128)               41088
_________________________________________________________________
activation_19 (Activation)   (None, 128)               0
_________________________________________________________________
dense_26 (Dense)             (None, 64)                8256
_________________________________________________________________
activation_20 (Activation)   (None, 64)                0
_________________________________________________________________
dense_27 (Dense)             (None, 16)                1040
_________________________________________________________________
activation_21 (Activation)   (None, 16)                0
=================================================================

Episode 1: reward: 245.996, steps: 600
Episode 2: reward: 157.407, steps: 600
Episode 3: reward: 194.500, steps: 600
Episode 4: reward: 211.616, steps: 600
Episode 5: reward: 196.251, steps: 600
Episode 6: reward: 197.038, steps: 600
Episode 7: reward: 222.596, steps: 600
Episode 8: reward: 198.707, steps: 600
Episode 9: reward: 219.930, steps: 600
Episode 10: reward: 221.857, steps: 600




_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
flatten_19 (Flatten)         (None, 4160)              0
_________________________________________________________________
dense_73 (Dense)             (None, 64)                266304
_________________________________________________________________
activation_55 (Activation)   (None, 64)                0
_________________________________________________________________
dense_74 (Dense)             (None, 256)               16640
_________________________________________________________________
activation_56 (Activation)   (None, 256)               0
_________________________________________________________________
dense_75 (Dense)             (None, 16)                4112
_________________________________________________________________
activation_57 (Activation)   (None, 16)                0
=================================================================
Total params: 287,056
Trainable params: 287,056
Non-trainable params: 0
Episode 1: reward: 127.671, steps: 600
Episode 2: reward: 187.280, steps: 600
Episode 3: reward: 203.713, steps: 600
Episode 4: reward: 147.678, steps: 600
Episode 5: reward: 210.619, steps: 600
Episode 6: reward: 163.055, steps: 600
Episode 7: reward: 164.455, steps: 600
Episode 8: reward: 197.386, steps: 600
Episode 9: reward: 181.188, steps: 600
Episode 10: reward: 150.546, steps: 600



_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
flatten_21 (Flatten)         (None, 1040)              0
_________________________________________________________________
dense_81 (Dense)             (None, 256)               266496
_________________________________________________________________
activation_61 (Activation)   (None, 256)               0
_________________________________________________________________
dense_82 (Dense)             (None, 64)                16448
_________________________________________________________________
activation_62 (Activation)   (None, 64)                0
_________________________________________________________________
dense_83 (Dense)             (None, 16)                1040
_________________________________________________________________
activation_63 (Activation)   (None, 16)                0
=================================================================
Total params: 283,984
Trainable params: 283,984
Non-trainable params: 0
_________________________________________________________________
Episode 1: reward: 205.901, steps: 600
Episode 2: reward: 261.306, steps: 600
Episode 3: reward: 215.877, steps: 600
Episode 4: reward: 233.231, steps: 600
Episode 5: reward: 194.591, steps: 600
Episode 6: reward: 231.762, steps: 600
Episode 7: reward: 230.518, steps: 600
Episode 8: reward: 241.337, steps: 600
Episode 9: reward: 207.091, steps: 600
Episode 10: reward: 200.294, steps: 600

